In [23]:
import pandas as pd 
import numpy as np

In [24]:
dates = pd.date_range('20130101', periods=6)
df1 = pd.DataFrame(np.arange(24).reshape((6,4)), index=dates, columns=['A', 'B', 'C', 'D'])
df1

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [25]:
df1.iloc[0,1]=np.nan
df1.iloc[1,2]=np.nan
df1

             A     B     C   D
2013-01-01   0   NaN   2.0   3
2013-01-02   4   5.0   NaN   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

## 检查数据是否丢失

### 1.把所有判断打印出来

In [26]:
df1.isnull()

                A      B      C      D
2013-01-01  False   True  False  False
2013-01-02  False  False   True  False
2013-01-03  False  False  False  False
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False

### 2.整体做判断 （只要有一个缺失就会报True）

In [31]:
print(np.any(  df1.isnull()  ) == True)

True

### 方法一： dropna丢弃数据

In [28]:
print(df1.dropna(axis=0,how='any'))   #how='all' 仅仅丢掉全是空值的行

             A     B     C   D
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23

In [29]:
print(df1.dropna(axis=1,how='any'))

             A   D
2013-01-01   0   3
2013-01-02   4   7
2013-01-03   8  11
2013-01-04  12  15
2013-01-05  16  19
2013-01-06  20  23

### 方法二： fillna填补数据

In [30]:
print(df1.fillna(value=0))

             A     B     C   D
2013-01-01   0   0.0   2.0   3
2013-01-02   4   5.0   0.0   7
2013-01-03   8   9.0  10.0  11
2013-01-04  12  13.0  14.0  15
2013-01-05  16  17.0  18.0  19
2013-01-06  20  21.0  22.0  23